# Розв’язати квадратне рівняння ax^2+bx+c=0.
# #Оформити перевірку вхідних даних (що рівняння є квадратним і має розв’язок на множині дійсних чисел)
# за допомогою оператора assert.

a = int(input("Введіть число а: "))
b = int(input("Введіть число b: "))
c = int(input("Введіть число c: "))
discriminant = ((b ** 2) - (4 * a * c))
assert a != 0, "Уведіть коректні дані для обчислення вашого квадратного р-ня"
assert discriminant >= 0, "Дискрімінант від'ємний, на множині дійсних чисел рівняння розвязку не має"
if discriminant > 0:
    x_1 = ((-b + (discriminant ** 0.5)) / (2 * a))
    x_2 = ((-b - (discriminant ** 0.5)) / (2 * a))
    print(x_1, x_2)
elif discriminant == 0:
    x_1_2 = (-b / (2 * a))
    print(x_1_2)
