'''Програма повинна прочитати з консолі натуральне число n та вивести в
порядку зростання n перших натуральних чисел, що не діляться на 2, 3 і 5.

Вхідні дані
Натуральне число n.

Вихідні дані
В одному рядку через проміжок n перших натуральних чисел, що не діляться на 2, 3 і 5.'''

'''n = int(input())
b = True
counter = 0
x = 0
while b:
    x += 1
    if counter == n:
        b = False
    if x % 2 != 0 and x % 3 != 0 and x % 5 != 0:
        print(x)
        counter += 1'''
n = int(input())
i = 1
count = 0  # к-сть чисел, що не діляться(всередині іф)
while count < n:
    i += 1
    if i % 2 != 0 and i % 3 != 0 and i % 5 != 0:
        print(i, end=" ")
        count += 1
print(count)
