"""На вході програми маємо натуральне число n.У відповідь потрібно вивести кількість n-значних
натуральних чисел, у записі яких використано тільки непарні цифри.

Вхідні дані
Натуральне число n.

Вихідні дані
Відповідь до задачі."""
n = int(input())
counter = 0
start = 10 ** (n - 1)
end = 10 ** n
for i in range(start, end):
    if i % 2 != 0 and (i // 10 ** (n - 1)) % 2 != 0:
        counter += 1
print(counter)
# i = int(input())
# i = i // 10 ** (n - 1)
# print(i)


# n = int(input())
# if n == 1:
#     count = 5
# else:
#     count = 5 * (5 ** (n - 1))
# print(count)
