"""Деякі числа непарні. Наприклад, число 3 непарне, так як не ділиться на два. Числа, які діляться на два,
непарними не будуть, вони називаються парними. Більш точно,
якщо число n можна представити у вигляді n = 2 * k для деякого цілого k, то n парне. Наприклад, 6 = 2 * 3 парне.

Деякі люди плутаються, чи є число парнv або непарнм. Щоб розібратися,
Ви можете задати запит інтернет пошукачу "чи є число парним або непарним?"
(Не виконуйте пошук! Розв'яжіть задачу!)

Напишіть програму для таких людей.

Bхідні дані
Починається рядком з кількістю вхідних даних n (1 ≤ n ≤ 20).
Кожен з наступних n рядків містить одне ціле число x (-10 ≤ x ≤ 10).

Вихідні дані
Для кожного x виведіть або 'x is odd', або 'x is even' в залежності від того, чи є x непарним або парним."""
"""n = int(input())
x = []
for i in range(n):
    b = int(input())
    x.append(b)
for i in x:
    if i % 2 == 0:
        print(i, "is even")
    else:
        print(i, "is odd")"""
n = int(input())
for i in range(n):
    x = int(input())
    if x % 2 == 0:
        print(x, "is even")
    else:
        print(x, "is odd")
# Або
n = int(input())
input_counter = 0
while input_counter < n:
    x = int(input())
    input_counter += 1
    if x % 2 == 0:
        print(x, "is even")
    else:
        print(x, "is odd")
