"""Назвемо пароль крипто стійким, якщо виконується 5 критеріїв

Пароль містить маленькі латинські латинські літери

Пароль містить великі латинські літери

Пароль містить цифри

Символи: ! " # $ % & ' ( ) * +

Довжина пароля не менше 8 символів

Потрібно за даним паролем встановити, скільки критеріїв крипто стійкості виконується.

Входні дані:
Вводиться один рядок, що складається тільки з латинських символів цифр і символів (п.4). Кількість символів не перевищує 100.

Вихідні дані
Виведіть кількість критеріїв крипто стійкості, яким задовільняє пароль."""
password = input()
safe = 0
symbols = "!'"'$%&"'"()*+#"
for i in range(ord("A"), ord("Z") + 1):
    if chr(i) in password:
        safe += 1
        break
for i in range(ord("a"), ord("z") + 1):
    if chr(i) in password:
        safe += 1
        break
for i in range(ord("1"), ord("9") + 1):
    if chr(i) in password:
        safe += 1
        break
for el in symbols:
    if el in password:
        safe += 1
        break
if len(password) >= 8:
    safe += 1
print(safe)
