"""Задано рядок s довжиною більше десяти символів. Враховуємо, що перший символ рядка має індекс 0.
Знайти і вивести отаке.

Слово, що утворюють третій, сьомий і одинадцятий символ рядка s.

Слово, що утворюють перший і два останніх символа рядка s.

Слово, що утворюють сім перших символів рядка s.

Рядок s без чотирьох перших символів.

Слово, що утворюють усі символи з непарними індексами, починаючи з другого символа рядка s..

Довжину слова з попереднього пункту.

Рядок s у зворотному порядку."""

row = input()
row_lst = list(row)
if len(row_lst) > 10:
    task_1 = row_lst[2] + row_lst[6] + row_lst[10]
    print(task_1)
    task_2 = row_lst[0] + row_lst[-2] + row_lst[-1]
    print(task_2)
    task_3 = ''.join(row_lst[0:7:])
    print(task_3)
    task_4 = ''.join(row_lst[4::])
    print(task_4)
    task_5 = ''.join(row_lst[1::2])
    print(task_5)
    task_6 = len(task_5)
    print(task_6)
    task_7 = ''.join(row_lst[::-1])
    print(task_7)
